In [1]:
import os

In [2]:
os.getcwd()

'C:\\Users\\poovi'

In [3]:
import pandas as pd

In [6]:
data4 = pd.read_excel(r'dat1.xlsx')

In [7]:
data4

   rollno   name  batch
0    1001   john   1840
1    1002  pinky   1703
2    1003   prem   1840
3    1004    ram   1760
4    1005    sam   1840

In [9]:
data5 = pd.read_csv(r'dat2.csv')

In [10]:
data5

   rollno   name  batch
0    1001   john   1840
1    1002  pinky   1703
2    1003   prem   1840
3    1004    ram   1760
4    1005    sam   1840

######

In [12]:
data6 = pd.read_csv(r'dat3.tsv', sep = '\t')

In [13]:
data6

   rollno  name  salary
0    1001  john   20000
1    1002  sema   15000
2    1003   ram   18000
3    1004   sam   25000